/*! \page page04 Хранение серийного номера

    Серийный номер хранится в OTP(One-Time-Programming (одноразово программируемой)) памяти.\n
    Структура OTP-памяти описана в секции 2.7 документа "PM0059 Programming manual STM32F205/215, STM32F207/217 Flash programming manual".\n
    В идеале серийный номер в текстовом виде хранится в 16 байтах по адресу 0x1FFF7800.\n
    Однако со временем может понадобиться изменить серийный номер (например, в случае изменения прошивки альтеры). В этом случае 16 байт, в которых
    записан текущий (неверный серийный номер), заполняются нулями, и новый номер записывается в следующих 16 байтах. Т.е. алгоритм считывания 
    серийного номера такой.\n
        1. Устанавливаем адрес address = 0x1FFF7800.\n
        2. Cчитываем 16 байт, начиная с адреса address.\n
        3. Увеличиваем address на 16 байт.\n
        4. Если все считанные байты равны 0, то переходим на 2.\n
        5. В считанных байтах находится серийный номер в виде текстовой строки, заканчивающейся нулём.\n
    Серийный номер записывается из меню <b>ОТЛАДКА</b> - <b>С/Н</b>.
*/
