/*! \page page08 Храниение и определение наименования модели и версии программного обеспечения
\code
+----------------+---------------+--------------+
| Тип информации | Старая версия | Новая версия |
+----------------+---------------+--------------+
| *** ЗАГРУЗЧИК ***                             |
|                |               |              |
|----------------+---------------+--------------+
| *** ОСНОВНАЯ ПРОШИВКА ***                     |
|                |               |              |
+----------------+---------------+--------------+
\endcode
*/
